:PROPERTIES:
:ID:       a7079bca-3f51-474f-8951-d171b4c137ba
:END:
#+Title: Introduction to Scripting for Scientists
#+Subtitle: A Very Brief Guide for the Intrepid Labratorian
#+Author: Delta Alexander Sharp
#+Email: nalisarc@gmail.com
#+STARTUP: beamer
#+STARTUP: indent
#+STARTUP: hidestars

* Setup                                                            :noexport:
#+begin_src ipython :session i2sc  
%matplotlib inline
import matplotlib.pyplot as plt
import numpy as np
import random 
#+end_src

#+RESULTS:
: # Out[1]:

#+name: org-ref-csl-preprocess
#+begin_src emacs-lisp
(add-hook 'org-export-before-parsing-hook 'org-ref-csl-preprocess-buffer)
#+end_src

#+RESULTS:
| org-ref-csl-preprocess-buffer | org-attach-expand-links |

 
#+begin_src emacs-lisp
(add-to-list 'org-latex-minted-langs '(ipython "python"))
#+end_src

#+RESULTS:
| ipython      | python      |
| emacs-lisp   | common-lisp |
| cc           | c++         |
| cperl        | perl        |
| shell-script | bash        |
| caml         | ocaml       |


